--                                          PostgreSQL

-- https://www.postgresql.org/              - доки

-- Преимущества:
-- Опенсоурсный(не принадлежит никакой компании) и соответсвенно полностьтю бесплатный продукт
-- Простая инсталяция и настройка, дефолтная конфигурация по умолчанию ок работает
-- Мощная, хорошо поддерживает транзакционность из коробки
-- Развитый SQL диалект



--                                       Скачивание и установка

-- https://www.postgresql.org/download/
-- Далее выбираем операционную систему -> Download the installer -> выбираем нужную версию в таблице(желательно поддерживаемую всеми системами)

-- Устанавливать можно все по умолчанию:
-- Директория для инсталяции:  C:\Program Files\PostgreSQL\16
-- Все галочки можно оставить: PostgreSQL - сама СУБД; pgAdmin 4 - графическая среда; Stack Builder - для апдейтов и инсталяции доп инструментов; Command Line Tools
-- Директория для данных:  C:\Program Files\PostgreSQL\16\data
-- Пароль для суперюзера:  123456
-- Порт: 5432
-- Локаль: по умолчанию
-- Stack Builder по завершению можно снять галочку и не запускать


-- https://www.pgadmin.org/              - отдельный ресурс для pgAdmin 4
-- pgAdmin 4  - графическая среда PostgreSQL запускает сервер, открывается в браузере(у меня почемуто в своем окнк открылочь) Спросит пароль заданный при установке
-- https://www.youtube.com/watch?v=HVQNxdI6fqY&list=PLBheEHDcG7-k1Y_Uy04Dj2ylWhcfSfqoF     - 56м основы работы



















--
